Open_Foam/Simulation_Src/0/include/frontBackPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


frontAndBack
{
    type empty;
}

front
{
    type empty;
}

back
{
    type empty;
}

// ************************************************************************* //
