Open_Foam/Simulation_Src/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       39900;
    }
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       40000;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       40050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40000;
        startFace       40100;
    }
)

// ************************************************************************* //
