Open_Foam/Simulation_Src/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 0 0)
    (0 0.5 0)
    (0 32 0)
    (-32 0 0)
    (0.5 0 0)
    (32 0 0)

    (-0.5 0 1)
    (0 0.5 1)
    (0 32 1)
    (-32 0 1)
    (0.5 0 1)
    (32 0 1)
);

blocks
(
    hex (0 1 2 3 6 7 8 9) (25 200 1) simpleGrading (1 80 1)
    hex (1 4 5 2 7 10 11 8) (25 200 1) simpleGrading (1 80 1)
);

edges
(
    arc 0 1 (-0.3535 0.3535 0)
    arc 2 3 (-22.6274 22.6274 0)
    arc 6 7 (-0.3535 0.3535 1)
    arc 8 9 (-22.6274 22.6274 1)

    arc 1 4 (0.3535 0.3535 0)
    arc 2 5 (22.6274 22.6274 0)
    arc 7 10 (0.3535 0.3535 1)
    arc 8 11 (22.6274 22.6274 1)
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            (1 0 6 7)
            (4 1 7 10)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (2 3 9 8)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }

    symm
    {
        type wall;
        faces
        (
            (0 3 9 6)
            (5 4 10 11)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (1 2 3 0)
            (1 4 5 2)
            (6 9 8 7)
            (7 8 11 10)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
