Open_Foam/Simulation_Src/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.01;

writeControl    runTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           5;

libs
(
    "libOpenFOAM.so"
    "libforces.so"
);


functions
{

    forcesCoeffs
    {
	    type        forceCoeffs;
	    //type        forces;

	    functionObjectLibs ( "libforces.so" );

	    outputControl   timeStep;
	    timeInterval    10;

	    log         no;

	    patches     ( cylinder );
	    pName       p;
	    UName       U;
	    rhoName     rhoInf;      // Indicates incompressible
	    log         true;
	    rhoInf      1000;           // Redundant for incompressible
	    liftDir     (0 1 0);
	    dragDir     (1 0 0);
	    CofR        (0 0 0);  // Axle midpoint on ground
	    pitchAxis   (0 0 1);
	    magUInf     1;
	    lRef        1;        // Wheelbase length
	    Aref        1;        // Estimated
    }
}

// ************************************************************************* //
